Option Strict Off
Option Explicit On
Public Class clsUnitLoginInfo
    '******************************************************************************
    ' ﾌﾟﾛｼﾞｪｸﾄ名  : ＭＫシステム共通
    ' ファイル名  : UnitLoginInfo.cls
    ' 内    容    : ログイン 情報 格納 クラス モジュール
    ' 備    考    :
    ' 関数一覧    : <Public>
    '               <Private>
    '               <Property>
    '                   LoginDate              I/O(ログイン日付)
    '                   CompanyCode            I/O(会社コード)
    '                   PostCode               I/O(所属コード)
    '                   EmployeeCode           I/O(従業員コード)
    '                   EmployeeName           I/O(従業員名)
    '                   SystemAuthority        I/O(システム権限)
    '                   Rank                   I/O(ランク)
    '                   OfficialPosition       I/O(役職位)
    '               <Events>
    '                   Class_Initialize       (クラス初期設定)
    '
    ' 変更履歴  :
    '   Version     日  付      氏  名             修正内容
    '   -----------+-----------+------------------+--------------------------------
    '   01.00.00    2007/12/12  廣井  芳明         新規作成
    '
    '******************************************************************************
    '==============================================================================
    ' 変数
    '==============================================================================
    Private mvntLoginDate As Object ' ログイン日付
    Private mstrCompanyCode As String ' 会社コード
    Private mstrCompanyName As String ' 会社名
    Private mstrPostCode As String ' 所属コード
    Private mstrPostName As String ' 部署名
    Private mstrEmployeeCode As String ' 従業員コード
    Private mstrEmployeeName As String ' 従業員名
    Private mintSystemAuthority As Short ' システム権限
    Private mstrRank As String ' ランク
    Private mintOfficialPosition As Short ' 役職位
    '_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/
    ' イベント
    '_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/
    '******************************************************************************
    ' 関 数 名  : Class_Initialize
    ' スコープ  : Public
    ' 処理内容  : ログイン従業員 情報 格納 クラス 初期設定
    ' 備    考  :
    ' 返 り 値  :
    ' 引 き 数  :
    '   ﾊﾟﾗﾒｰﾀ名            ﾃﾞｰﾀﾀｲﾌﾟ          I/O   説 明
    '   -------------------+-----------------+-----+-------------------------------
    '
    ' 変更履歴  :
    '   Version     日  付      氏  名             修正内容
    '   -----------+-----------+------------------+--------------------------------
    '   01.00.00    2007/12/12  廣井  芳明         新規作成
    '
    '******************************************************************************
    'UPGRADE_NOTE: Class_Initialize was upgraded to Class_Initialize_Renamed. Click for more: 'ms-help://MS.VSCC.v90/dv_commoner/local/redirect.htm?keyword="A9E4979A-37FA-4718-9994-97DD76ED70A7"'
    Private Sub Class_Initialize_Renamed()

        'UPGRADE_WARNING: Couldn't resolve default property of object mvntLoginDate. Click for more: 'ms-help://MS.VSCC.v90/dv_commoner/local/redirect.htm?keyword="6A50421D-15FE-4896-8A1B-2EC21E9037B2"'
        mvntLoginDate = ""
        mstrCompanyCode = ""
        mstrPostCode = ""
        mstrPostName = ""
        mstrEmployeeCode = ""
        mstrEmployeeName = ""
        mintSystemAuthority = -1
        mstrRank = ""
        mintOfficialPosition = -1

    End Sub
    Public Sub New()
        MyBase.New()
        Class_Initialize_Renamed()
    End Sub
    '_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/
    ' プロパティ
    '_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/
    '******************************************************************************
    ' 関 数 名  : OfficialPosition
    ' スコープ  : Public
    ' 処理内容  : 役職位 取得
    ' 備    考  :
    ' 返 り 値  : 役職位
    ' 引 き 数  :
    '   ﾊﾟﾗﾒｰﾀ名            ﾃﾞｰﾀﾀｲﾌﾟ          I/O   説 明
    '   -------------------+-----------------+-----+-------------------------------
    '
    ' 変更履歴  :
    '   Version     日  付      氏  名             修正内容
    '   -----------+-----------+------------------+--------------------------------
    '   01.00.00    2007/12/12  廣井  芳明         新規作成
    '
    '******************************************************************************
    '******************************************************************************
    ' 関 数 名  : OfficialPosition
    ' スコープ  : Public
    ' 処理内容  : 役職位 設定
    ' 備    考  :
    ' 返 り 値  :
    ' 引 き 数  :
    '   ﾊﾟﾗﾒｰﾀ名            ﾃﾞｰﾀﾀｲﾌﾟ          I/O   説 明
    '   -------------------+-----------------+-----+-------------------------------
    '   pintValue           Integer           I     役職位
    '
    ' 変更履歴  :
    '   Version     日  付      氏  名             修正内容
    '   -----------+-----------+------------------+--------------------------------
    '   01.00.00    2007/12/12  廣井  芳明         新規作成
    '
    '******************************************************************************
    Public Property OfficialPosition() As Short
        Get

            OfficialPosition = mintOfficialPosition

        End Get
        Set(ByVal Value As Short)

            mintOfficialPosition = Value

        End Set
    End Property
    '******************************************************************************
    ' 関 数 名  : Rank
    ' スコープ  : Public
    ' 処理内容  : ランク 取得
    ' 備    考  :
    ' 返 り 値  : ランク
    ' 引 き 数  :
    '   ﾊﾟﾗﾒｰﾀ名            ﾃﾞｰﾀﾀｲﾌﾟ          I/O   説 明
    '   -------------------+-----------------+-----+-------------------------------
    '
    ' 変更履歴  :
    '   Version     日  付      氏  名             修正内容
    '   -----------+-----------+------------------+--------------------------------
    '   01.00.00    2007/12/12  廣井  芳明         新規作成
    '
    '******************************************************************************
    '******************************************************************************
    ' 関 数 名  : Rank
    ' スコープ  : Public
    ' 処理内容  : ランク 設定
    ' 備    考  :
    ' 返 り 値  :
    ' 引 き 数  :
    '   ﾊﾟﾗﾒｰﾀ名            ﾃﾞｰﾀﾀｲﾌﾟ          I/O   説 明
    '   -------------------+-----------------+-----+-------------------------------
    '   pstrValue           String            I     ランク
    '
    ' 変更履歴  :
    '   Version     日  付      氏  名             修正内容
    '   -----------+-----------+------------------+--------------------------------
    '   01.00.00    2007/12/12  廣井  芳明         新規作成
    '
    '******************************************************************************
    Public Property Rank() As String
        Get

            Rank = mstrRank

        End Get
        Set(ByVal Value As String)

            mstrRank = Value

        End Set
    End Property
    '******************************************************************************
    ' 関 数 名  : SystemAuthority
    ' スコープ  : Public
    ' 処理内容  : システム権限 取得
    ' 備    考  :
    ' 返 り 値  : システム権限
    ' 引 き 数  :
    '   ﾊﾟﾗﾒｰﾀ名            ﾃﾞｰﾀﾀｲﾌﾟ          I/O   説 明
    '   -------------------+-----------------+-----+-------------------------------
    '
    ' 変更履歴  :
    '   Version     日  付      氏  名             修正内容
    '   -----------+-----------+------------------+--------------------------------
    '   01.00.00    2007/12/12  廣井  芳明         新規作成
    '
    '******************************************************************************
    '******************************************************************************
    ' 関 数 名  : SystemAuthority
    ' スコープ  : Public
    ' 処理内容  : システム権限 設定
    ' 備    考  :
    ' 返 り 値  :
    ' 引 き 数  :
    '   ﾊﾟﾗﾒｰﾀ名            ﾃﾞｰﾀﾀｲﾌﾟ          I/O   説 明
    '   -------------------+-----------------+-----+-------------------------------
    '   pintValue           Integer           I     システム権限
    '
    ' 変更履歴  :
    '   Version     日  付      氏  名             修正内容
    '   -----------+-----------+------------------+--------------------------------
    '   01.00.00    2007/12/12  廣井  芳明         新規作成
    '
    '******************************************************************************
    Public Property SystemAuthority() As Short
        Get

            SystemAuthority = mintSystemAuthority

        End Get
        Set(ByVal Value As Short)

            mintSystemAuthority = Value

        End Set
    End Property
    '******************************************************************************
    ' 関 数 名  : EmployeeName
    ' スコープ  : Public
    ' 処理内容  : ログイン従業員名 取得
    ' 備    考  :
    ' 返 り 値  : ログイン従業員名
    ' 引 き 数  :
    '   ﾊﾟﾗﾒｰﾀ名            ﾃﾞｰﾀﾀｲﾌﾟ          I/O   説 明
    '   -------------------+-----------------+-----+-------------------------------
    '
    ' 変更履歴  :
    '   Version     日  付      氏  名             修正内容
    '   -----------+-----------+------------------+--------------------------------
    '   01.00.00    2007/12/12  廣井  芳明         新規作成
    '
    '******************************************************************************
    '******************************************************************************
    ' 関 数 名  : EmployeeName
    ' スコープ  : Public
    ' 処理内容  : ログイン従業員名 設定
    ' 備    考  :
    ' 返 り 値  :
    ' 引 き 数  :
    '   ﾊﾟﾗﾒｰﾀ名            ﾃﾞｰﾀﾀｲﾌﾟ          I/O   説 明
    '   -------------------+-----------------+-----+-------------------------------
    '   pstrValue           String            I     ログイン従業員名
    '
    ' 変更履歴  :
    '   Version     日  付      氏  名             修正内容
    '   -----------+-----------+------------------+--------------------------------
    '   01.00.00    2007/12/12  廣井  芳明         新規作成
    '
    '******************************************************************************
    Public Property EmployeeName() As String
        Get

            EmployeeName = mstrEmployeeName

        End Get
        Set(ByVal Value As String)

            mstrEmployeeName = Value

        End Set
    End Property
    '******************************************************************************
    ' 関 数 名  : EmployeeCode
    ' スコープ  : Public
    ' 処理内容  : ログイン従業員コード 取得
    ' 備    考  :
    ' 返 り 値  : ログイン従業員コード
    ' 引 き 数  :
    '   ﾊﾟﾗﾒｰﾀ名            ﾃﾞｰﾀﾀｲﾌﾟ          I/O   説 明
    '   -------------------+-----------------+-----+-------------------------------
    '
    ' 変更履歴  :
    '   Version     日  付      氏  名             修正内容
    '   -----------+-----------+------------------+--------------------------------
    '   01.00.00    2007/12/12  廣井  芳明         新規作成
    '
    '******************************************************************************
    '******************************************************************************
    ' 関 数 名  : EmployeeCode
    ' スコープ  : Public
    ' 処理内容  : ログイン従業員コード 設定
    ' 備    考  :
    ' 返 り 値  :
    ' 引 き 数  :
    '   ﾊﾟﾗﾒｰﾀ名            ﾃﾞｰﾀﾀｲﾌﾟ          I/O   説 明
    '   -------------------+-----------------+-----+-------------------------------
    '   pstrValue           String            I     ログイン従業員コード
    '
    ' 変更履歴  :
    '   Version     日  付      氏  名             修正内容
    '   -----------+-----------+------------------+--------------------------------
    '   01.00.00    2007/12/12  廣井  芳明         新規作成
    '
    '******************************************************************************
    Public Property EmployeeCode() As String
        Get

            EmployeeCode = mstrEmployeeCode

        End Get
        Set(ByVal Value As String)

            mstrEmployeeCode = Value

        End Set
    End Property
    '******************************************************************************
    ' 関 数 名  : PostCode
    ' スコープ  : Public
    ' 処理内容  : ログイン所属コード 取得
    ' 備    考  :
    ' 返 り 値  : ログイン所属コード
    ' 引 き 数  :
    '   ﾊﾟﾗﾒｰﾀ名            ﾃﾞｰﾀﾀｲﾌﾟ          I/O   説 明
    '   -------------------+-----------------+-----+-------------------------------
    '
    ' 変更履歴  :
    '   Version     日  付      氏  名             修正内容
    '   -----------+-----------+------------------+--------------------------------
    '   01.00.00    2007/12/12  廣井  芳明         新規作成
    '
    '******************************************************************************
    '******************************************************************************
    ' 関 数 名  : PostCode
    ' スコープ  : Public
    ' 処理内容  : ログイン所属コード 設定
    ' 備    考  :
    ' 返 り 値  :
    ' 引 き 数  :
    '   ﾊﾟﾗﾒｰﾀ名            ﾃﾞｰﾀﾀｲﾌﾟ          I/O   説 明
    '   -------------------+-----------------+-----+-------------------------------
    '   pstrValue           String            I     ログイン所属コード
    '
    ' 変更履歴  :
    '   Version     日  付      氏  名             修正内容
    '   -----------+-----------+------------------+--------------------------------
    '   01.00.00    2007/12/12  廣井  芳明         新規作成
    '
    '******************************************************************************
    Public Property PostCode() As String
        Get

            PostCode = mstrPostCode

        End Get
        Set(ByVal Value As String)

            mstrPostCode = Value

        End Set
    End Property
    '******************************************************************************
    ' 関 数 名  : PostName
    ' スコープ  : Public
    ' 処理内容  : ログイン部署名 取得
    ' 備    考  :
    ' 返 り 値  : ログイン部署名
    ' 引 き 数  :
    '   ﾊﾟﾗﾒｰﾀ名            ﾃﾞｰﾀﾀｲﾌﾟ          I/O   説 明
    '   -------------------+-----------------+-----+-------------------------------
    '
    ' 変更履歴  :
    '   Version     日  付      氏  名             修正内容
    '   -----------+-----------+------------------+--------------------------------
    '   01.00.00    2011/04/21  廣井  芳明         新規作成
    '
    '******************************************************************************
    '******************************************************************************
    ' 関 数 名  : PostName
    ' スコープ  : Public
    ' 処理内容  : ログイン部署名 設定
    ' 備    考  :
    ' 返 り 値  :
    ' 引 き 数  :
    '   ﾊﾟﾗﾒｰﾀ名            ﾃﾞｰﾀﾀｲﾌﾟ          I/O   説 明
    '   -------------------+-----------------+-----+-------------------------------
    '   pstrValue           String            I     ログイン部署名
    '
    ' 変更履歴  :
    '   Version     日  付      氏  名             修正内容
    '   -----------+-----------+------------------+--------------------------------
    '   01.00.00    2011/04/21  廣井  芳明         新規作成
    '
    '******************************************************************************
    Public Property PostName() As String
        Get

            PostName = mstrPostName

        End Get
        Set(ByVal Value As String)

            mstrPostName = Value

        End Set
    End Property
    '******************************************************************************
    ' 関 数 名  : CompanyCode
    ' スコープ  : Public
    ' 処理内容  : ログイン会社コード 取得
    ' 備    考  :
    ' 返 り 値  : ログイン会社コード
    ' 引 き 数  :
    '   ﾊﾟﾗﾒｰﾀ名            ﾃﾞｰﾀﾀｲﾌﾟ          I/O   説 明
    '   -------------------+-----------------+-----+-------------------------------
    '
    ' 変更履歴  :
    '   Version     日  付      氏  名             修正内容
    '   -----------+-----------+------------------+--------------------------------
    '   01.00.00    2007/12/12  廣井  芳明         新規作成
    '
    '******************************************************************************
    '******************************************************************************
    ' 関 数 名  : CompanyCode
    ' スコープ  : Public
    ' 処理内容  : ログイン会社コード 設定
    ' 備    考  :
    ' 返 り 値  :
    ' 引 き 数  :
    '   ﾊﾟﾗﾒｰﾀ名            ﾃﾞｰﾀﾀｲﾌﾟ          I/O   説 明
    '   -------------------+-----------------+-----+-------------------------------
    '   pstrValue           String            I     ログイン会社コード
    '
    ' 変更履歴  :
    '   Version     日  付      氏  名             修正内容
    '   -----------+-----------+------------------+--------------------------------
    '   01.00.00    2007/12/12  廣井  芳明         新規作成
    '
    '******************************************************************************
    Public Property CompanyCode() As String
        Get

            CompanyCode = mstrCompanyCode

        End Get
        Set(ByVal Value As String)

            mstrCompanyCode = Value

        End Set
    End Property
    '******************************************************************************
    ' 関 数 名  : CompanyName
    ' スコープ  : Public
    ' 処理内容  : ログイン会社名 取得
    ' 備    考  :
    ' 返 り 値  : ログイン会社名
    ' 引 き 数  :
    '   ﾊﾟﾗﾒｰﾀ名            ﾃﾞｰﾀﾀｲﾌﾟ          I/O   説 明
    '   -------------------+-----------------+-----+-------------------------------
    '
    ' 変更履歴  :
    '   Version     日  付      氏  名             修正内容
    '   -----------+-----------+------------------+--------------------------------
    '   01.00.00    2011/04/21  廣井  芳明         新規作成
    '
    '******************************************************************************
    '******************************************************************************
    ' 関 数 名  : CompanyName
    ' スコープ  : Public
    ' 処理内容  : ログイン会社名 設定
    ' 備    考  :
    ' 返 り 値  :
    ' 引 き 数  :
    '   ﾊﾟﾗﾒｰﾀ名            ﾃﾞｰﾀﾀｲﾌﾟ          I/O   説 明
    '   -------------------+-----------------+-----+-------------------------------
    '   pstrValue           String            I     ログイン会社名
    '
    ' 変更履歴  :
    '   Version     日  付      氏  名             修正内容
    '   -----------+-----------+------------------+--------------------------------
    '   01.00.00    2011/04/21  廣井  芳明         新規作成
    '
    '******************************************************************************
    Public Property CompanyName() As String
        Get

            CompanyName = mstrCompanyName

        End Get
        Set(ByVal Value As String)

            mstrCompanyName = Value

        End Set
    End Property
    '******************************************************************************
    ' 関 数 名  : LoginDate
    ' スコープ  : Public
    ' 処理内容  : ログイン日付 取得
    ' 備    考  :
    ' 返 り 値  : ログイン日付
    ' 引 き 数  :
    '   ﾊﾟﾗﾒｰﾀ名            ﾃﾞｰﾀﾀｲﾌﾟ          I/O   説 明
    '   -------------------+-----------------+-----+-------------------------------
    '
    ' 変更履歴  :
    '   Version     日  付      氏  名             修正内容
    '   -----------+-----------+------------------+--------------------------------
    '   01.00.00    2007/12/12  廣井  芳明         新規作成
    '
    '******************************************************************************
    '******************************************************************************
    ' 関 数 名  : LoginDate
    ' スコープ  : Public
    ' 処理内容  : ログイン日付 設定
    ' 備    考  :
    ' 返 り 値  :
    ' 引 き 数  :
    '   ﾊﾟﾗﾒｰﾀ名            ﾃﾞｰﾀﾀｲﾌﾟ          I/O   説 明
    '   -------------------+-----------------+-----+-------------------------------
    '   pvntValue           Variant           I     ログイン日付
    '
    ' 変更履歴  :
    '   Version     日  付      氏  名             修正内容
    '   -----------+-----------+------------------+--------------------------------
    '   01.00.00    2007/12/12  廣井  芳明         新規作成
    '
    '******************************************************************************
    Public Property LoginDate() As Object
        Get

            'UPGRADE_WARNING: Couldn't resolve default property of object mvntLoginDate. Click for more: 'ms-help://MS.VSCC.v90/dv_commoner/local/redirect.htm?keyword="6A50421D-15FE-4896-8A1B-2EC21E9037B2"'
            'UPGRADE_WARNING: Couldn't resolve default property of object LoginDate. Click for more: 'ms-help://MS.VSCC.v90/dv_commoner/local/redirect.htm?keyword="6A50421D-15FE-4896-8A1B-2EC21E9037B2"'
            LoginDate = mvntLoginDate

        End Get
        Set(ByVal Value As Object)

            'UPGRADE_WARNING: Couldn't resolve default property of object pvntValue. Click for more: 'ms-help://MS.VSCC.v90/dv_commoner/local/redirect.htm?keyword="6A50421D-15FE-4896-8A1B-2EC21E9037B2"'
            'UPGRADE_WARNING: Couldn't resolve default property of object mvntLoginDate. Click for more: 'ms-help://MS.VSCC.v90/dv_commoner/local/redirect.htm?keyword="6A50421D-15FE-4896-8A1B-2EC21E9037B2"'
            mvntLoginDate = Value

        End Set
    End Property
End Class